#تمرین: برنامهاي بنویسید که حقوق یک فرد را سوال کند، سپس طبق مقادیر زیر، مالیات را از حقوق کسر نماید؟ و در غیر
#اینصورت پیغام خطا صادر شود.
#1000 -30000 20% .1
#31000 -50000 30% .2
#51000 -75000 35% .3
#>75000 40% .4




#!/bin/bash
caltax()
{
finsal=0
if [ $# -eq 1 ]
then
if
[ $1 -lt 30001 ]
then
finsal=$((($1*20)/100))
elif [ $1 -lt 50001 ]
then
finsal=$((($1*30)/100))
elif [ $1 -lt 75001 ]
then
finsal=$((($1*35)/100))
elif [ $1 -gt 75000 ]
then
finsal=$((($1*40)/100))
fi
fi
echo $(($1-$finsal))
}
caltax $1